Repository: yamasitain/algae-petition
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: Content purported to be compressed with %s but failed to decompress.
de_de: Der Inhalt ist angeblich mit %s komprimiert, konnte aber nicht entpackt werden.

source: Unsupported value for qop: %s.
de_de: Wert %s ist für qop nicht unterstützt.

source: Unsupported value for algorithm: %s.algorithm
de_de: Wert %s.algorithm ist für algorithm nicht unterstützt.

source: The challenge doesn't contain a server nonce, or this one is empty.
de_de: Die Challenge enthält kein Server-generiertes Nonce, oder die Nonce ist leer.

source: Unsupported value for pw-algorithm: %s.pw-algorithm
de_de: Wert %s.pw-algorithm ist nicht unterstützt für pw-algorithm.

source: Redirected but the response is missing a Location: header.
de_de: Redirect, wobei aber ein Location: header fehlt.

source: Page Not Found
de_de: Seite nicht gefunden

source: Sorry. A serious error has occured.
de_de: Es tut mir leid. Ein schwerwiegender Fehler ist aufgetreten.

source: Return home.
de_de: Zurück zur Startseite.

source: Algae is an application template for Google App Engine
de_de: Algae ist ein Anwendungs-Template für Google App Engine

source: Users
de_de: Benutzer

source: Security
de_de: Sicherheit

source: Testing
de_de: Testen

source: About
de_de: Über

source: Profiles
de_de: Profile

source: <code>gae/handlers/oauth.py</code> and <code>gae/handlers/email_auth.py</code> request handlers are responsible for processing OAuth and email user authentication. <br> <code>USER_ATTR</code> dictionary in <code>gae/handlers/oauth.py</code> defines how user fields map between different services (identity providers) and the app's internal user model. The rest is a lot of smart Python code you needn't worry about.
de_de: <code>gae/handlers/oauth.py</code> und <code>gae/handlers/email_auth.py</code> Request Handler sind für das Verarbeiten von OAuth und Email Benutzerauthentifikation zuständig. <br> <code>USER_ATTR</code> Dictionary in <code>gae/handlers/oauth.py</code> definiert wie Benutzerfelder zwischen den unterschiedlichen Authentifizierungs-Services (Providern) und dem internen User-Modell zugeordnet werden. Der Rest wird von cleverem Python-Code gemacht, um den Sie sich keine Sorgen machen müssen.

source: <p>Signed in as <img style="max-width:100px" src = "%(pic)s"> via <a href="%(profile)s">%(username)s</a>. <a href="/logout">Logout</a>
de_de: <p>Angemeldet als <img style="max-width:100px" src = "%(pic)s"> via <a href="%(profile)s">%(username)s</a>. <a href="/logout">Abmelden</a> "

source: No one is signed in. Sign in with: <ul> <li><a href="/auth/facebook">Facebook</a> <li><a href="/auth/google">Google</a> <li><a href="/auth/twitter">Twitter</a> <li><a data-toggle="modal" href="#signup">Sign up</a> or <a data-toggle="modal" href="#signin">sign in</a> with email </ul>
de_de: Niemand ist angemeldet. Bitte anmelden mit: <ul> <li><a href="/auth/facebook">Facebook</a> <li><a href="/auth/google">Google</a> <li><a href="/auth/twitter">Twitter</a> <li><a data-toggle="modal" href="#signup">Registrieren</a> oder <a data-toggle="modal" href="#signin">Anmelden</a> mit Email und Passwort </ul>

source: Sessions are tracked by encrypted, client-side cookies. <code>COOKIE_TEMPLATE</code> variable in <code>gae/settings.py</code> defines the cookie content, and <code>session</code> dictionary can be accessed in every request handler. </blockquote> <p>Reload this page. The number of pageviews should increase. <p>Pageviews: %(pageviews)s
de_de: Sessions werden mit verschlüsslten Cookies realisiert. Die <code>COOKIE_TEMPLATE</code>-Variable in <code>gae/settings.py</code> liefert die Standardwerte, und das <code>session</code>-Dictionary kann von jedem Request-Handler angesprochen werden. </blockquote> <p>Ein Beispiel: Die Seitenzugriffe werden in der Session gezählt. Beim Neuladen sollte sich diese Zahl hier erhöhen. <p>Seitenzugriffe: %(pageviews)s

source: Full CRUD access to models is supported via POST, PUT, GET, and DELETE AJAX calls. See <code>gae/static/js/script.js</code> for sample code. The calls are routed via <code>BaseRESTHandler</code> in <code>gae/handlers/common.py</code> <br> The forms below are automatically generated from model definitions in <code>gae/code/model.py</code>. <code>generate_model_form()</code> in <code>gae/core/model.py</code> converts the model to a dictionary of template variables, and <code>gae/static/templates/forms.html</code> macro generates the corresponding HTML.
de_de: Vollständiger CRUD-Zugriff auf die Modelle wird mit POST, PUT, GET und DELETE AJAX-Aufrufen gestattet. Siehe <code>gae/static/js/script.js</code> für Beispiel-Code. Die Aufrufe werden mit dem <code>BaseRESTHandler</code> in <code>gae/handlers/common.py</code> verarbeitet.<br> Die Formulare werden automatisch von den Model-Definitionen in <code>gae/code/model.py</code> erstellt. Die Function <code>generate_mode_form()</code> in <code>gae/core/model.py</code> wandelt das Model in ein Dictionary von Template-Variablen um, und <code>gae/static/templates/forms.html</code> Macro generiert das entsprechende HTML.

source: Create Entity
de_de: Element anlegen

source: Heads up!
de_de: Achtung!

source: Only logged in users are authorized to create new entities. See Security tab for how to modify these rules for your app.
de_de: Nur angemeldete Benutzer können neue Elemente anlegen. Das Tab Sicherheit erklärt wie diese Regeln in der Anwendung angepasst werden können.

source: Update/Delete Entity
de_de: Ändern/Löschen eines Elements

source: Only logged in users are authorized to delete entities. See Security tab for how to modify these rules for your app.
de_de: Nur angemeldete Benutzer können Elemente löschen. Das Tab Sicherheit erklärt wie diese Regeln in der Anwendung angepasst werden können.

source: Update
de_de: Ändern

source: Delete
de_de: Löschen

source: Summary
de_de: Zusammenfassung

source: Action
de_de: Aktion

source: Algae is designed to get you app running on Google App Engine in less than 3 minutes and 42 seconds. Guaranteed, or your money back.
de_de: Mit Algae läuft Ihre Anwendung in weniger als 3 Minuten 42 Sekunden auf Google App Engine. Mit Geld-zurück-Garantie.

source: Algae integrates de facto industry standards (like Twitter Bootstrap and HTML5 Boilerplate) with features every web app needs (like user management and third-party authentication). It's flexible, functional, and easy to use.
de_de: Algae kombiniert de-facto Industriestandards (wie z.B. Twitter Bootstrap und HTML5 Boilerplate) mit Eigenschaften die jede Web-Andwendung braucht (wie Benutzermanagement und Authentifizierung über Drittanwendungen). Es ist flexibel, funktionell und einfach zu verwenden.

source: Here is what you get:
de_de: Das ist alles dabei:

source: User account framework, including:
de_de: Benutzerverwaltungsframework, einschließlich:

source: Twitter authentication
de_de: Anmeldung über Twitter

source: Google authentication
de_de: Anmeldung über Google

source: Facebook authentication
de_de: Anmeldung über Facebook

source: Email authentication
de_de: Anmeldung mit Email/Passwort

source: Others (<em>Work in progress</em>)
de_de: Andere (<em>in Arbeit</em>)

source: Plain and RESTful style API bootstrap code:
de_de: Einfacher und RESTful-basierter API Basic-Code:

source: Auto-generate HTML forms from GAE data model
de_de: Automatische Erzeugung von HTML-Formularen aus GAE-Datenmodell

source: Seamless entity CRUD via AJAX
de_de: Nahtloses CRUD mittels AJAX

source: jQuery form validation
de_de: jQuery Formular-Überprüfung

source: Basic testing infrastructure (<em>Work in progress</em>)
de_de: Einfache Test-Infrstruktur (<em>in Arbeit</em>)

source: and more..
de_de: und mehr..

source: Finally, a GAE template to write home about!
de_de: Endlich, ein GAE Template von dem man erzählen kann!

source: A Python decorator -- <code>@with_login</code> -- can be used on any method of <code>BaseHandler</code> or <code>BaseAPIHandler</code> (or their subclasses) to prevent unauthenticated users from viewing certain pages or calling APIs.
de_de: Ein Python-Dekorator -- <code>@with_login</code> -- kann auf jede Methode von <code>BaseHandler</code> oder <code>BaseAPIHandler</code> (oder deren Unterklassen) angewendet werden, um unangemeldeten Benutzern das Sehen einzelner Seiten oder den Aufruf einzelner APIs zu verwehren.

source: For instance, this <a href="/login_only">page</a> can only be viewed after you login.
de_de: Ein Beispiel: diese <a href="/login_only">Seite</a> kann nur gesehen werden wenn man angemeldet ist.

source: If the above command fails, make sure that <code>webtest</code> and <code>unittest2</code> Python modules are installed and that <code>APPLICATION_ID</code> and <code>SERVER_SOFTWARE</code> environment variables are set correctly, as they are required by <code>testrunner.py</code> script to run.
de_de: Falls der vorige Befehl nicht funktioniert, stellen Sie sicher dass die <code>webtest</code> und <code>unittest2</code> Python-Module installiert sind und dass die beiden Environment-Variablen <code>APPLICATION_ID</code> und <code>SERVER_SOFTWARE</code> richtig gesetzt sind, da diese von <code>testrunner.py</code> benötigt werden.

source: Here is how to set environment variables:
de_de: So werden die Variablen richtig gesetzt:

source: Algae comes preconfigured for internationalization, so your application can speak multiple languages.
de_de: Algae kommt mit allem was für Internationalisierung notwendig ist, damit Ihre Anwendung mehrere Sprachen sprechen kann.

source: To use this feature, make sure you have both <code>jinja2</code> and <code>babel</code> installed to compile the translations for Algae.
de_de: Um dieses Feature auszunutzen, stellen Sie sicher dass sowohl <code>jinja2</code> als auch <code>babel</code> lokal installiert sind.

source: These steps are needed for creating a multilanguage application:
de_de: Diese Schritte sind notwendig um eine mehrsprachige Anwendung zu erstellen:

source: Configure the locales
de_de: Locales konfigurieren

source: Prepare code &amp; templates for i18n
de_de: Python- und jinja2-Templates für i18n vorbereiten

source: Extract strings into separate messages file
de_de: Sprachspezifische Texte extrahieren

source: Translate the messages into all needed languages
de_de: Sprachspezifische Texte übersetzen

source: Compile message files
de_de: Texte für die Laufzeit optimieren

source: In <code>settings.py</code> you find the list of the supported locales. Update this list according to your needs.
de_de: In der Datei <code>settings.py</code> finden Sie die Liste der unterstützten Locales. Diese Liste passen Sie Ihrem Bedarf entsprechend an.

source: In essence this boils down to putting any language-specific text into a sequence of <code>%(transtxt)s</code> - <code>%(endtranstxt)s</code> in the jinja2-template files and into a sequence of <code>_('</code> - <code>')</code> in the python files.
de_de: Im Wesentlichen bedeutet das, dass Sie sprachspezifische Texte in den jinja2-Templates jeweils in eine <code>%(transtxt)s</code> - <code>%(endtranstxt)s</code> Sequenz einschließen, und in den Python-Dateien in einen Aufruf von <code>_('</code> - <code>')</code> einklammern.

source: Each python file will need to add an import for this to work:
de_de: Jede Python-Datei wird den folgenden Import benötigen:

source: Some special handling is possible in the jinja2-templates, see <a href="http://jinja.pocoo.org/docs/templates/#i18n-in-templates" target="_blank">i18n in templates</a> from the jinja2 documentation.
de_de: Zusätzliche Möglichkeiten stehen in den jinja2-Templates offen, mehr Information gibt es in <a href="http://jinja.pocoo.org/docs/templates/#i18n-in-templates" target="_blank">i18n in Templates</a> aus der jinja2- Dokumentation.

source: And in case your template contains almost only text which has to be translated, you can create a separate template file per language and reference the template in the python code with <code>_('</code><code>')</code>.<br> You will then treat the name of the template as a language-dependent text, which could be 'template.html' for English and 'template.html.de' for German.
de_de: Falls Ihr Template fast nur sprachabhängige Texte enthält, können Sie auch sprachabhängige Template-Files verwenden, und im Python-Code das Template mittels <code>_('</code><code>')</code> auswählen. Sie behandeln damit den Namen der Template-Datei als einen sprachabhängigen Text, der z.B. 'template.html' für Englisch und 'template.html.de' für Deutsch sein könnte.

source: In this step you extract all the strings in the templates and python files into a translation template.
de_de: In diesem Schritt extrahieren Sie alle markierten sprachabhängigen Texte aus den Python-Dateien und jinja2-Templates in eine Übersetzungsvorlage.

source: Use the following command:
de_de: Verwenden Sie den folgenden Befehl:

source: The very first time when you start your application or when you add a new language you can enter the command:
de_de: Das allererste Mal, wenn Sie Ihre Anwendung in eine neue Sprache übersetzen, geben Sie den folgenden Befehl ein:

source: However, once you have started with translating text into a language you should use the command
de_de: Danach verwenden Sie aber nur den Befehl

source: The 'update' will preserve old translations.
de_de: Hier wird durch 'update' Ihre bisherige Übersetzungsarbeit erhalten bleiben.

source: Now you find in the folder <code>./locale/en_US</code> a file named <code>message.po</code> which you can edit and add valid translations for the locale.
de_de: Nun finden Sie in dem Ordner <code>./locale/en_US</code> eine Datei namens <code>message.po</code>, die Sie bearbeiten und mit Übersetzungen in der Zielsprache ergänzen können.

source: In this last step you are optimizing the messages files for runtime.
de_de: In diesem letzten Schritt werden die Sprachdateien für die Laufzeit optimiert.

source: Use the following command for this purpose:
de_de: Verwenden Sie dazu den folgende Befehl:

source: View this page in <a href="/locale/de_DE">German</a>
de_de: Diese Seite in <a href="/locale/en_US">Englisch</a> ansehen

source: Change Email Address
de_de: Ändere E-Mail Adresse

source: Only logged in users can change their email address. You can <a href="/">login here</a>.
de_de: Nur angemeldete Benutzer können ihre E-Mail Adresse anpassen. <a href="/">Hier</a> kann man sich anmelden.

source: Email address
de_de: E-Mail Adresse

source: Change
de_de: Ändern

source: Add To Mailing List
de_de: Zur Mailing-Liste hinzufügen

source: Sign Up
de_de: Registrieren

source: Sign up with your email address
de_de: Mit E-Mail-Adresse registrieren

source: Password
de_de: Passwort

source: Sign in
de_de: Anmelden

source: Sign In
de_de: Anmelden

source: Your browser is <em>ancient!</em>
de_de: Ihr Browser ist <em>steinalt!</em>

source: <a href="http://browsehappy.com/">Upgrade to a different browser</a> or <a href="http://www.google.com/chromeframe/?redirect=true">install Google Chrome Frame</a> to experience this site.
de_de: <a href="http://browsehappy.com/">Aktualisieren Sie auf einen anderen Browser, oder <a href="http://www.google.com/chromeframe/?redirect=true">installieren Sie Google Chrome Frame</a> um diese Seite anzusehen.

source: Algae was created by Ilya Bagrak, who <a href="http://twitter.com/ibagrak">tweets</a>, <a href="http://codercofounder.wordpress.com">blogs</a>, and responds to all <a href="https://mail.google.com/mail/?view=cm&amp;fs=1&amp;tf=1&amp;to=replace-with-ilya.replace-with-bagrak@gmail.com" target="_blank">email</a>.
de_de: Algae ist ein Werk von Ilya Bagrak, der <a href="http://twitter.com/ibagrak">twittert</a>, <a href="http://codercofounder.wordpress.com">bloggt</a>, und auf alle <a href="https://mail.google.com/mail/?view=cm&amp;fs=1&amp;tf=1&amp;to=replace-with-ilya.replace-with-bagrak@gmail.com" target="_blank">E-Mails</a> antwortet.
